In [1]:
import pandas as pd
import requests

EP = "https://raw.githubusercontent.com/ppabam/nextjs-fastapi-starter/refs/heads/main/endpoints.json"

In [13]:
# res = requests.get(EP)

In [12]:
# res.status_code

In [14]:
# res.encoding

In [10]:
# res.text

In [15]:
data = res.json()

In [16]:
type(data)

dict

In [19]:
endpoints = data['endpoints']
type(endpoints)

list

In [21]:
for p in endpoints:
    print(f'{p["name"]}, {p["url"]}')

TOM, https://ac.sunsin.shop/api/py/select_all
jiwon, https://agecal.wodan10.shop/api/py/select_all
heejin, https://age.journeyjean.shop/api/py/select_all
hyun, https://agecalculator.calcalhan.store/api/py/select_all
cho, https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all
jacob, https://jacob0503.vercel.app/api/py/select_table
nuni, https://ac.nunininu.shop/api/py/select_all
lucas, https://ac.lucas12.store/api/py/select_all
SEO, https://ac.seo-sigma.shop/api/py/select_all
JERRY, https://jooon.vercel.app/api/py/select_all

In [29]:
# df_tom = 
# df_jerry = 
res = requests.get("https://ac.sunsin.shop/api/py/select_all")
# res.status_code
data = res.json()
df_tom = pd.DataFrame(data)
df_tom.head(1)

  menu_name name          dt
0       설렁탕  TOM  2025-02-07

In [30]:
res = requests.get("https://jooon.vercel.app/api/py/select_all")
# res.status_code
data = res.json()
df_jerry = pd.DataFrame(data)
df_jerry.head(1)

     menu_name   name          dt
0  베이컨토마토디럭스세트  JERRY  2025-02-06

In [37]:
# 나의 df 에 없는 row 를 찾아서 새로운 df 으로 만들기
new_rows = []
for _, row_j in df_jerry.iterrows():
    is_match_row = True
    for _, row_t in df_tom.iterrows():
        is_match_columns = True
        for c_name in df_tom.columns:
            # if .... row_j[c_name] != row_t['c_name']
            pass

    if not is_match_row:
        new_rows.append(row)

df_new = pd.DataFrame(new_rows)

In [60]:
import pandas as pd

df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4, 5], "name": ["MIN", "LEE", "PARK", "TOM"]})
df3 = pd.DataFrame({"id": [5, 4, 2, 3], "name": ["TOM", "PARK","MIN", "LEE"]})

In [43]:
from pandasql import sqldf
query = """
SELECT df2.id, df2.name
FROM df2
LEFT JOIN df1
ON df2.id = df1.id AND df2.name = df1.name
WHERE df1.id IS NULL
"""

pysqldf = lambda q: sqldf(q, globals())

def pysqldf(q):
    sqldf(q, locals())

df_diff_1 = sqldf(query, locals()) 
df_diff_1

   id  name
0   4  PARK
1   5   TOM

In [44]:
new_rows = []

for _, row_2 in df2.iterrows():
    is_match_row = False
    for _, row_1 in df1.iterrows():
        is_match_columns = True
        for c_name in df1.columns:
            if row_2[c_name] != row_1[c_name]:
                is_match_columns = False
                break
                
        if is_match_columns:
            is_match_row = True

    if not is_match_row:
        new_rows.append(row_2)
        
df_diff_2 = pd.DataFrame(new_rows)
df_diff_2

   id  name
2   4  PARK
3   5   TOM

In [45]:
merge_df = pd.merge(df1, df3, how="right", indicator=True)

In [46]:
df_diff_3 = merge_df[merge_df['_merge'] == 'right_only'].drop('_merge', axis=1)
df_diff_3

   id  name
0   5   TOM
1   4  PARK

In [49]:
## TODO
#df_diff_1, df_diff_2, df_diff_3 의 결과가 같은지 비교
df_diff_1.reset_index(drop=True).equals(df_diff_2.reset_index(drop=True))

True

In [51]:
df_diff_1.reset_index(drop=True).equals(df_diff_3.reset_index(drop=True))

False

In [55]:
df_diff_3.sort_values(by=['id','name']).reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [56]:
df_diff_1.sort_values(by=['id','name']).reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [59]:
df_diff_3.columns.tolist()

['id', 'name']

In [57]:
d3 = df_diff_3.sort_values(by=['id','name']).reset_index(drop=True)
d1 = df_diff_1.sort_values(by=['id','name']).reset_index(drop=True)
d3.equals(d1)

True